#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-prod-5183.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-prod-5183.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "tians-testing-b-ce-id-dev-test-prod-5183"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-prod-5183.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-prod-5183.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-prod-5183.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-prod-5183.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "tians-testing-b-ce-id-dev-test-prod-5183"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "tians-testing-b-ce-id-dev-test-prod-5183"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-both"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://example",
        ]
      + web_origins                              = [
          + "+",
          + "https://example",
        ]
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.access_token_aud will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      - client_id       = "d444d4a5-f772-4560-8840-d9fe028bd4b7" -> null
      - config          = {
          - "access.token.claim"       = "true"
          - "id.token.claim"           = "false"
          - "included.client.audience" = "tians-testing-b-ce-id-dev-test-5182"
        } -> null
      - id              = "d01efae2-5fd6-455d-aa38-6a4e98eb922c" -> null
      - name            = "access_token_aud" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-audience-mapper" -> null
      - realm_id        = "onestopauth-both" -> null
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      - client_id       = "d444d4a5-f772-4560-8840-d9fe028bd4b7" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_business_guid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_business_guid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "a3aadfea-d574-48d9-a462-89ef276969fe" -> null
      - name            = "bceid_business_guid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-both" -> null
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      - client_id       = "d444d4a5-f772-4560-8840-d9fe028bd4b7" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_business_name"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_business_name"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "f1740981-9b4e-4174-9634-1f1ac50f42ad" -> null
      - name            = "bceid_business_name" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-both" -> null
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      - client_id       = "d444d4a5-f772-4560-8840-d9fe028bd4b7" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_userid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_userid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "9291b249-bb0c-423f-9c4f-b8f37ad8cc42" -> null
      - name            = "bceid_userid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-both" -> null
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.client_roles_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      - client_id       = "d444d4a5-f772-4560-8840-d9fe028bd4b7" -> null
      - config          = {
          - "access.token.claim"                   = "true"
          - "claim.name"                           = "client_roles"
          - "id.token.claim"                       = "true"
          - "jsonType.label"                       = "String"
          - "multivalued"                          = "true"
          - "userinfo.token.claim"                 = "true"
          - "usermodel.clientRoleMapping.clientId" = "tians-testing-b-ce-id-dev-test-5182"
        } -> null
      - id              = "63b0a054-5cc2-4fa6-9ba9-d7ffdfd97673" -> null
      - name            = "client_roles" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-client-role-mapper" -> null
      - realm_id        = "onestopauth-both" -> null
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      - client_id       = "d444d4a5-f772-4560-8840-d9fe028bd4b7" -> null
      - config          = {
          - "access.token.claim"         = "true"
          - "access.tokenResponse.claim" = "false"
          - "claim.name"                 = "identity_provider"
          - "id.token.claim"             = "true"
          - "jsonType.label"             = "String"
          - "user.session.note"          = "identity_provider"
        } -> null
      - id              = "2245f448-40ff-43a5-8a09-1d95e4332ac1" -> null
      - name            = "IDP" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usersessionmodel-note-mapper" -> null
      - realm_id        = "onestopauth-both" -> null
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      - client_id       = "d444d4a5-f772-4560-8840-d9fe028bd4b7" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "idir_guid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "idir_guid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "0a2b6031-236e-4e91-b294-7f1ab892799b" -> null
      - name            = "idir_guid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-both" -> null
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      - client_id       = "d444d4a5-f772-4560-8840-d9fe028bd4b7" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "idir_userid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "idir_userid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "978008d7-b824-4c91-870f-a2746ecdcd34" -> null
      - name            = "idir_userid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-both" -> null
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-5182.keycloak_openid_client.this will be destroyed
  - resource "keycloak_openid_client" "this" {
      - access_type                              = "CONFIDENTIAL" -> null
      - client_id                                = "tians-testing-b-ce-id-dev-test-5182" -> null
      - client_secret                            = (sensitive value)
      - consent_required                         = false -> null
      - description                              = "CSS App Created" -> null
      - direct_access_grants_enabled             = false -> null
      - enabled                                  = true -> null
      - exclude_session_state_from_auth_response = false -> null
      - full_scope_allowed                       = false -> null
      - id                                       = "d444d4a5-f772-4560-8840-d9fe028bd4b7" -> null
      - implicit_flow_enabled                    = false -> null
      - name                                     = "tians-testing-b-ce-id-dev-test-5182" -> null
      - realm_id                                 = "onestopauth-both" -> null
      - service_accounts_enabled                 = false -> null
      - standard_flow_enabled                    = true -> null
      - valid_redirect_uris                      = [
          - "https://exampleddd",
        ] -> null
      - web_origins                              = [] -> null
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-prod-5183.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "tians-testing-b-ce-id-dev-test-prod-5183"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-prod-5183.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-prod-5183.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-prod-5183.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-prod-5183.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "tians-testing-b-ce-id-dev-test-prod-5183"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-prod-5183.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-prod-5183.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-prod-5183.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-b-ce-id-dev-test-prod-5183.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "tians-testing-b-ce-id-dev-test-prod-5183"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "tians-testing-b-ce-id-dev-test-prod-5183"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-both"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://example",
        ]
      + web_origins                              = [
          + "+",
          + "https://example",
        ]
    }

Plan: 18 to add, 0 to change, 18 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3519 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*